{"cells":[{"metadata":{},"id":"657be689","cell_type":"markdown","source":"# Самостоятельное задание #3\n\n\n### Задание 1\n\nДопишите функцию, которая принимает массив из 10 чисел и возвращает их сумму."},{"metadata":{"trusted":true},"id":"18ffcbab","cell_type":"code","source":"N=10\nsum=0\ndef nums_sum(sum):\n    for i in range(1,N+1):\n        sum+=i\n    return sum\nnums_sum(sum)\n        \n    ","execution_count":1,"outputs":[{"output_type":"execute_result","execution_count":1,"data":{"text/plain":"55"},"metadata":{}}]},{"metadata":{},"id":"eb78afc0","cell_type":"markdown","source":"\n### Задание 2\n\nДопишите функцию, которая принимает массив чисел и возвращает количество чисел равных нулю."},{"metadata":{"trusted":true},"id":"7e8fe536","cell_type":"code","source":"arr=[]\nnum=0\ndef number_of_zeros(num):\n    for i in arr:\n        if i==0:\n            num+=1\n    return num\narr=[1,2,3,0,0,0,3,5,2,1,0]\nnumber_of_zeros(num)","execution_count":11,"outputs":[{"output_type":"execute_result","execution_count":11,"data":{"text/plain":"4"},"metadata":{}}]},{"metadata":{},"id":"570d5a26","cell_type":"markdown","source":"\n### Задание 3\n\nНапишите программу, в которой задается  натуральное число n и выводится лестница из n ступенек, i-я ступенька должна состоять из чисел от 1 до i без пробелов."},{"metadata":{"trusted":true},"id":"69fd0501","cell_type":"code","source":"N=5\nfor i in range(1,N+1):\n    print('', end='')\n    for j in range(1,i+1):\n        print(j,end='')\n    print()","execution_count":13,"outputs":[{"output_type":"stream","text":"1\n12\n123\n1234\n12345\n","name":"stdout"}]},{"metadata":{},"id":"b6ef1c44","cell_type":"markdown","source":"\n### Задание 4\n\nНапишите программу, в которой задается натуральное число n и выводится пирамида из n ступенек, i-я ступень должна состоять из чисел от 1 до i и обратно без пробелов."},{"metadata":{"trusted":true},"id":"6b038f87","cell_type":"code","source":"N=5\nfor i in range(1,N+1):\n    print(' '*(N-i), end='')\n    for j in range(1,i+1):\n        print(j,end='')\n    for j in range(i-1,0,-1):\n        print(j,end='')\n    print()","execution_count":14,"outputs":[{"output_type":"stream","text":"    1\n   121\n  12321\n 1234321\n123454321\n","name":"stdout"}]},{"metadata":{},"id":"b4552ef5","cell_type":"markdown","source":"\n### Задание 5\n\nНапишите программу, в которой задается натуральное число n и выводится ромб из `n*2-1` ступенек, i-я ступень должна состоять из чисел от 1 до i и обратно без пробелов."},{"metadata":{"trusted":true},"id":"5eaae897","cell_type":"code","source":"N=5\nfor i in range(1,N+1):\n    print(' '*(N-i), end='')\n    for j in range(1,i+1):\n        print(j,end='')\n    for j in range(i-1,0,-1):\n        print(j,end='')\n    print()\nfor i in range(N-1,0,-1):\n    print(' '*(N-i), end='')\n    for j in range(1,i+1):\n        print(j,end='')\n    for j in range(i-1,0,-1):\n        print(j,end='')\n    print()","execution_count":15,"outputs":[{"output_type":"stream","text":"    1\n   121\n  12321\n 1234321\n123454321\n 1234321\n  12321\n   121\n    1\n","name":"stdout"}]},{"metadata":{"trusted":true},"cell_type":"code","source":"","execution_count":null,"outputs":[]}],"metadata":{"kernelspec":{"name":"python3","display_name":"Python 3","language":"python"},"language_info":{"name":"python","version":"3.6.13","mimetype":"text/x-python","codemirror_mode":{"name":"ipython","version":3},"pygments_lexer":"ipython3","nbconvert_exporter":"python","file_extension":".py"}},"nbformat":4,"nbformat_minor":5}